// Рассчитывает и выводит на экран n-ое число Фибоначчи при помощи рекурсивного алгоритма.
// Сам поиск n-ого числа Фибоначчи должен быть выделен в отдельную функцию.
// Число вводится через стандартный поток ввода. В случае ошибки выводить «n/a»

#include <stdio.h>

int fib(int n);

int fib(int n) {
    if (n == 0) {
        return 0;
    }

    if (n == 1 || n == 2) {
        return 1;
    }

    return fib(n - 1) + fib(n - 2);
}

int main() {
    int n;
    scanf("%d", &n);

    if (n < 0) {
        printf("n/a");
        return 0;
    }

    printf("%d", fib(n));

    return 0;
}